zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
/**
  ******************************************************************************
  * @file    stm32h5xx_hal_dma2d.c
  * @author  MCD Application Team
  * @brief   DMA2D HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the DMA2D peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Errors functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
           The DMA2D supports two exclusive operating modes: Direct Mode and Command List Mode.
           You can select the desired mode with the compilation define in the file stm32_hal_conf.h as follows:

           Set USE_DMA2D_COMMAND_LIST_MODE to 1 to enable Command List Mode. In this mode, a series of SIMD instructions
           are prepared in a command list, which, once executed, loads the register values
           and starts the DMA2D operations automatically.
           Set USE_DMA2D_COMMAND_LIST_MODE to 0 to use Direct Mode, which provides direct access
           to the DMA2D registers for immediate operation control.
    [..]
      (#) Program the required configuration through the following parameters:
          the transfer mode, the output color mode the output offset and the alpha position using
          HAL_DMA2D_Init() function.

      (#) Program the required configuration through the following parameters:
          the input color mode, the input color, the input alpha value, the alpha mode,
          the red/blue swap mode, the inverted alpha mode, the input offset and the alpha position using
          HAL_DMA2D_ConfigLayer() function for foreground or/and background layer.

      (#) Program the required configuration by specifying the mirroring/rotation type using the
          HAL_DMA2D_ConfigRotation() for the selected source foreground, background, or blender output

      (#) Program the downscaling parameters by providing the horizontal and vertical scaling ratios,
          pixel dimensions, and phase values through a DMA2D_DownscalingCfgTypeDef structure and
          using the HAL_DMA2D_ConfigDownscaling() function for the selected source foreground,
          background, or blender output.

      (#) Program the stencil buffer configuration by specifying the source, stencil mode,
          buffer address, line offset, and horizontal pre/post pixels
          using a DMA2D_StencilCfgTypeDef structure and using the HAL_DMA2D_ConfigStencil() function
          to configure the stencil buffer settings for the selected source.

     *** Polling mode IO operation ***
     =================================
    [..]
       (#) Configure pdata parameter (explained hereafter), destination and data length
           and enable the transfer using HAL_DMA2D_Start().
       (#) Wait for end of transfer using HAL_DMA2D_PollForTransfer(), at this stage
           user can specify the value of timeout according to his end application.

     *** Interrupt mode IO operation ***
     ===================================
     [..]
       (#) Configure pdata parameter, destination and data length and enable
           the transfer using HAL_DMA2D_Start_IT().
       (#) Use HAL_DMA2D_IRQHandler() called under DMA2D_IRQHandler() interrupt subroutine.
       (#) At the end of data transfer HAL_DMA2D_IRQHandler() function is executed and user can
           add his own function by customization of function pointer XferCpltCallback (member
           of DMA2D handle structure).
       (#) In case of error, the HAL_DMA2D_IRQHandler() function calls the callback
           XferErrorCallback.

         -@-   In Register-to-Memory transfer mode, pdata parameter is the register
               color, in Memory-to-memory or Memory-to-Memory with pixel format
               conversion pdata is the source address.

         -@-   Configure the foreground source address, the background source address,
               the destination and data length then Enable the transfer using
               HAL_DMA2D_BlendingStart() in polling mode and HAL_DMA2D_BlendingStart_IT()
               in interrupt mode.

         -@-   HAL_DMA2D_BlendingStart() and HAL_DMA2D_BlendingStart_IT() functions
               are used if the memory to memory with blending transfer mode is selected.

      (#) Optionally, configure and enable the CLUT using HAL_DMA2D_CLUTLoad() in polling
          mode or HAL_DMA2D_CLUTLoad_IT() in interrupt mode.

      (#) Optionally, configure the line watermark in using the API HAL_DMA2D_ProgramLineEvent().

      (#) Optionally, configure the dead time value in the AHB clock cycle inserted between two
          consecutive accesses on the AHB master port in using the API HAL_DMA2D_ConfigDeadTime()
          and enable/disable the functionality  with the APIs HAL_DMA2D_EnableDeadTime() or
          HAL_DMA2D_DisableDeadTime().

      (#) The transfer can be suspended, resumed and aborted using the following
          functions: HAL_DMA2D_Suspend(), HAL_DMA2D_Resume(), HAL_DMA2D_Abort().

      (#) The CLUT loading can be suspended, resumed and aborted using the following
          functions: HAL_DMA2D_CLUTLoading_Suspend(), HAL_DMA2D_CLUTLoading_Resume(),
          HAL_DMA2D_CLUTLoading_Abort().

      (#) To control the DMA2D state, use the following function: HAL_DMA2D_GetState().

      (#) To read the DMA2D error code, use the following function: HAL_DMA2D_GetError().

     *** DMA2D HAL driver macros list ***
     =============================================
     [..]
       Below the list of most used macros in DMA2D HAL driver :

