zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
      (+) __HAL_DMA2D_ENABLE: Enable the DMA2D peripheral.
      (+) __HAL_DMA2D_GET_FLAG: Get the DMA2D pending flags.
      (+) __HAL_DMA2D_CLEAR_FLAG: Clear the DMA2D pending flags.
      (+) __HAL_DMA2D_ENABLE_IT: Enable the specified DMA2D interrupts.
      (+) __HAL_DMA2D_DISABLE_IT: Disable the specified DMA2D interrupts.
      (+) __HAL_DMA2D_GET_IT_SOURCE: Check whether the specified DMA2D interrupt is enabled or not.

     *** Callback registration ***
     ===================================
     [..]
      (#) The compilation define  USE_HAL_DMA2D_REGISTER_CALLBACKS when set to 1
          allows the user to configure dynamically the driver callbacks.
          Use function @ref HAL_DMA2D_RegisterCallback() to register a user callback.

      (#) Function @ref HAL_DMA2D_RegisterCallback() allows to register following callbacks:
            (+) XferCpltCallback : callback for transfer complete.
            (+) XferErrorCallback : callback for transfer error.
            (+) LineEventCallback : callback for line event.
            (+) CLUTLoadingCpltCallback : callback for CLUT loading completion.
            (+) MspInitCallback    : DMA2D MspInit.
            (+) MspDeInitCallback  : DMA2D MspDeInit.
          This function takes as parameters the HAL peripheral handle, the Callback ID
          and a pointer to the user callback function.

      (#) Use function @ref HAL_DMA2D_UnRegisterCallback() to reset a callback to the default
          weak (overridden) function.
          @ref HAL_DMA2D_UnRegisterCallback() takes as parameters the HAL peripheral handle,
          and the Callback ID.
          This function allows to reset following callbacks:
            (+) XferCpltCallback : callback for transfer complete.
            (+) XferErrorCallback : callback for transfer error.
            (+) LineEventCallback : callback for line event.
            (+) CLUTLoadingCpltCallback : callback for CLUT loading completion.
            (+) MspInitCallback    : DMA2D MspInit.
            (+) MspDeInitCallback  : DMA2D MspDeInit.

      (#) By default, after the @ref HAL_DMA2D_Init and if the state is HAL_DMA2D_STATE_RESET
          all callbacks are reset to the corresponding legacy weak (overridden) functions:
          examples @ref HAL_DMA2D_LineEventCallback(), @ref HAL_DMA2D_CLUTLoadingCpltCallback()
          Exception done for MspInit and MspDeInit callbacks that are respectively
          reset to the legacy weak (overridden) functions in the @ref HAL_DMA2D_Init
          and @ref HAL_DMA2D_DeInit only when these callbacks are null (not registered beforehand)
          If not, MspInit or MspDeInit are not null, the @ref HAL_DMA2D_Init and @ref HAL_DMA2D_DeInit
          keep and use the user MspInit/MspDeInit callbacks (registered beforehand).

          Exception as well for Transfer Completion and Transfer Error callbacks that are not defined
          as weak (overridden) functions. They must be defined by the user to be resorted to.

          Callbacks can be registered/unregistered in READY state only.
          Exception done for MspInit/MspDeInit callbacks that can be registered/unregistered
          in READY or RESET state, thus registered (user) MspInit/DeInit callbacks can be used
          during the Init/DeInit.
          In that case first register the MspInit/MspDeInit user callbacks
          using @ref HAL_DMA2D_RegisterCallback before calling @ref HAL_DMA2D_DeInit
          or @ref HAL_DMA2D_Init function.

          When The compilation define USE_HAL_DMA2D_REGISTER_CALLBACKS is set to 0 or
          not defined, the callback registering feature is not available
          and weak (overridden) callbacks are used.

     [...]

        DMA2D Command List Mode enables efficient execution of graphic operations by preparing sequences
        of instructions in memory, organized as linear command lists referenced by a ring buffer.
        The DMA2D hardware processes these instructions, updating internal registers and performing data transfer
        thereby offloading the CPU.

        Ring Buffer
      +----------------+----------------+----------------+
      | Descriptor 1   | Descriptor 2   | Descriptor 3   |  <-- Head Pointer
      +----------------+----------------+----------------+
             |                 |                 |
      Linear Command List  Linear Command List  Linear Command List
      +------------+       +------------+       +------------+
      | Instr 1    |       | Instr 1    |       | Instr 1    |
      | Instr 2    |       | Instr 2    |       | Instr 2    |
      | ...        |       | ...        |       | ...        |
      | END        |       | END        |       | END        |
      +------------+       +------------+       +------------+

      [...] Ring Buffer Configuration

            The ring buffer is a circular memory area in your system RAM that holds descriptors.
            Each descriptor points to a linear command list a series of instructions for the DMA2D hardware.

            To set this up, you first initialize the DMA2D peripheral and configure the ring buffer by calling
            the function HAL_DMA2D_CL_Init() and specifying:
             - The size of the ring buffer (how many descriptors it can hold).
             - The base address of the ring buffer in system memory.
            This configuration ensures the DMA2D hardware knows where to fetch command list descriptors for execution.

      [...] Linear Command Lists Preparation
            Each descriptor in the ring buffer references a linear command list,
            which is essentially a buffer of DMA2D instructions and register values.

            You initialize these command list buffers by HAL_DMA2D_CL_Init_CommandList() to provide:
            - The memory address where the command list instructions will be stored.
            - The size of this buffer.

             Once initialized, you can start building your command lists by adding commands that configure
             the DMA2D Hardware.

      [...] Command List instructions build
                 The driver provides a set of APIs to add commands to your linear command lists:

                 (#) Program the required configuration through the following parameters: transfer mode,
                  output color mode, output offset, and alpha position using the HAL_DMA2D_CL_Init() function.

                 (#) Program Layer required configuration through the following parameters: input color mode,
                 input alpha value, alpha mode, red/blue swap mode, inverted alpha mode, input offset,
                 and alpha position using the HAL_DMA2D_CL_AddConfigLayerCMD() function
                 for the foreground and/or background layer.

                 (#) Program the stencil buffer address, stencil mode, and line offset with pixels to be skipped
                 at the beginning and at the end (HTRAIL, HPRE, VTRAIL, VPRE) using the function
                 HAL_DMA2D_CL_AddConfigStencilCMD() for the foreground layer, background layer, or blender output.

