zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
                 (#) Program the mirroring or rotation type using the HAL_DMA2D_CL_AddConfigRotationCMD()
                 function for the foreground layer, background layer, or blender output.

                 (#) Program for downscaling PixelPerLines, NumberOfLines, VStep, HStep, VPhase, and HPhase using
                 the HAL_DMA2D_CL_AddConfigDownscalingCMD() function for the foreground layer, background layer,
                 or blender output.

                (#) Optionally, configure the line watermark in using the function
                HAL_DMA2D_CL_AddProgramLineEventCMD().

      [...] Command List Copy ans Data Transfers Enable
                 Use the following APIs to enable data transfer for the selected operating mode and to copy
                 the constructed command list to the address pointed to by pCommandList, as chosen by the user.

                 Each API appends the necessary instructions and register values to the command list buffer,
                 building a sequence of operations that the DMA2D hardware will execute.

            (+++)Configure using HAL_DMA2D_CL_AddCopyCMD():
                 -@- Register-to-Memory transfer mode: The pdata parameter(register color),
                     the destination, the data length, and enable the transfer.
                 -@- Memory-to-Memory or Memory-to-Memory with pixel format conversion:
                     The pdata parameter (the source address), the destination, the data length and enable the transfer
                     then copy the instructions to the command list buffer.
            (+++)Configure using HAL_DMA2D_CL_AddBlendingCMD():
                 The foreground source address, the background source address,
                 the destination, data length and enable the transfer then copy the instructions
                 to the command list buffer.

            (+++)Optionally configure using HAL_DMA2D_CL_AddCLUTStartLoadCMD():
                 The CLUT Color Mode, the CLUT size and enable the CLUT loading then copy the instructions
                 to the command list buffer.

      [...] Linear Command Lists Insersion
            (+)Insert Command Lists into the Ring Buffer HAL_DMA2D_CL_InsertCommandList()
               Once your command lists are prepared, you insert them into the ring buffer .

            (+)During insertion, you can also configure General Purpose Flags (GPFLAGs) to control synchronization or
               trigger specific behaviors before and after executing each command list.

      [...]  Command List Execution and Interrupt
            (+) Once you have queued your prepared command lists into the ring buffer,you can initiate their execution
                by the DMA2D hardware HAL_DMA2D_CL_Start(), where the register values will be effectively loaded into
                the DMA2D registers, and the operations will be started sequentially.
                This function enables all relevant DMA2D interrupts, allowing you to monitor the execution progress
                and handle events such as completion or errors seamlessly.

                If you require more control over interrupt management, you can use HAL_DMA2D_CL_StartOpt(), which lets
                you selectively enable or disable specific DMA2D interrupts according to your application needs.

            (+) Use HAL_DMA2D_CL_IRQHandler() called under DMA2D_IRQHandler() interrupt subroutine.
            (+) At each event HAL_DMA2D_CL_IRQHandler() function is executed and the corresponding weak callback
               (member of DMA2D CL handle structure DMA2D_CL_HandleTypeDef) is called:
                  (+)RBXferCpltCallback : callback for Ring Buffer transfer complete.
                  (+)CL_SuspendCallback : callback for Command List Suspend.
                  (+)CL_GeneralPurposeEventCallback : callback for General Purpose Flag Event.
                  (+)XferErrorCallback : callback for transfer error.
                  (+)XferCpltCallback : callback for data transfer complete.
                  (+)LineEventCallback : callback for line event.
                  (+)CLUTLoadingCpltCallback : callback for CLUT loading completion.
                  (+)ErrorCallback : callback for error (Ring Buffer Management and Command List Errors)
                  (+)MspInitCallback : DMA2D MspInit.
                  (+)MspDeInitCallback : DMA2D MspDeInit.
            (+) The above list of most used macros in DMA2D HAL driver can be used

            (+) The Command List execution can be suspended and resumed through
                HAL_DMA2D_CL_Suspend() and HAL_DMA2D_CL_Resume()
                You can Abort command list execution immediately if needed by HAL_DMA2D_CL_Abort()

     [..]
      (@) You can refer to the DMA2D HAL driver header file for more useful macros

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

#ifdef HAL_DMA2D_MODULE_ENABLED
#if defined (DMA2D)

/** @addtogroup STM32H5xx_HAL_Driver
  * @{
  */

/** @defgroup DMA2D  DMA2D
  * @brief DMA2D HAL module driver
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup DMA2D_Private_Constants DMA2D Private Constants
  * @{
  */

/** @defgroup DMA2D_TimeOut DMA2D Time Out
  * @{
  */
#define DMA2D_TIMEOUT_ABORT           (1000U)  /*!<  1s  */
#define DMA2D_TIMEOUT_SUSPEND         (1000U)  /*!<  1s  */
/**
  * @}
  */

#if (USE_DMA2D_COMMAND_LIST_MODE == 1)
/** @defgroup DMA2D_CL_Registers DMA2D Command List Registers
  * @{
  */
#define DMA2D_CL_CR_REG          0U
#define DMA2D_CL_IER_REG         1U
#define DMA2D_CL_IFCR_REG        2U
#define DMA2D_CL_FGMAR_REG       3U
#define DMA2D_CL_FGOR_REG        4U
#define DMA2D_CL_FGMSR_REG       5U
#define DMA2D_CL_FGPFCCR_REG     6U
#define DMA2D_CL_FGCOLR_REG      7U
#define DMA2D_CL_FGCMAR_REG      8U
#define DMA2D_CL_BGMAR_REG       9U
#define DMA2D_CL_BGOR_REG       10U
#define DMA2D_CL_BGMSR_REG      11U
#define DMA2D_CL_BGPFCCR_REG    12U
#define DMA2D_CL_BGCOLR_REG     13U
#define DMA2D_CL_BGCMAR_REG     14U
#define DMA2D_CL_OPFCCR_REG     15U
#define DMA2D_CL_OCOLR_REG      16U
#define DMA2D_CL_OMAR_REG       17U
#define DMA2D_CL_OOR_REG        18U
#define DMA2D_CL_NLR_REG        19U
#define DMA2D_CL_SBCR_REG       20U
#define DMA2D_CL_SBMAR_REG      21U
#define DMA2D_CL_SBOR_REG       22U
#define DMA2D_CL_SBMSR_REG      23U
#define DMA2D_CL_TBCR_REG       24U
#define DMA2D_CL_SCR_REG        25U
#define DMA2D_CL_SNLR_REG       26U
#define DMA2D_CL_SSR_REG        27U
#define DMA2D_CL_SPR_REG        28U
#define HAL_DMA2D_CL_LDM_REG_NUM    29U
const uint32_t LDM_Decoder[HAL_DMA2D_CL_LDM_REG_NUM] =
{
  1 << 30U, /* DMA2D_CL_CR_REG      */
    1 << 29U, /* DMA2D_CL_IER_REG     */
    1 << 28U, /* DMA2D_CL_IFCR_REG    */
    1 << 27U, /* DMA2D_CL_FGMAR_REG   */
    1 << 27U, /* DMA2D_CL_FGOR_REG    */
    1 << 26U, /* DMA2D_CL_FGMSR_REG   */
    1 << 25U, /* DMA2D_CL_FGPFCCR_REG */
    1 << 24U, /* DMA2D_CL_FGCOLR_REG  */
    1 << 23U, /* DMA2D_CL_FGCMAR_REG  */
    1 << 22U, /* DMA2D_CL_BGMAR_REG   */
    1 << 22U, /* DMA2D_CL_BGOR_REG    */
    1 << 21U, /* DMA2D_CL_BGMSR_REG   */
    1 << 20U, /* DMA2D_CL_BGPFCCR_REG */
    1 << 19U, /* DMA2D_CL_BGCOLR_REG  */
    1 << 18U, /* DMA2D_CL_BGCMAR_REG  */
    1 << 17U, /* DMA2D_CL_OPFCR_REG   */
    1 << 16U, /* DMA2D_CL_OCOLR_REG   */
    1 << 15U, /* DMA2D_CL_OMAR_REG    */
    1 << 15U, /* DMA2D_CL_OOR_REG     */
    1 << 14U, /* DMA2D_CL_NLR_REG     */
    1 << 13U, /* DMA2D_CL_SBCR_REG    */
    1 << 12U, /* DMA2D_CL_SBMAR_REG   */
    1 << 12U, /* DMA2D_CL_SBOR_REG    */
    1 << 11U, /* DMA2D_CL_SBMSR_REG   */
    1 << 7U, /* DMA2D_CL_TBCR_REG    */
    1 << 3U, /* DMA2D_CL_SCR_REG     */
    1 << 2U, /* DMA2D_CL_SNLR_REG    */
    1 << 2U, /* DMA2D_CL_SSR_REG     */
    1 << 2U  /* DMA2D_CL_SPR_REG     */
};
#define DMA2D_CL_LDM_MODIFY_REG(HANDLE, REG, MASK, VALUE) \
  ((HANDLE)->LDM_Reg_values[(REG)] = ((HANDLE)->LDM_Reg_values[(REG)] & ~(MASK)) | ((VALUE) & (MASK)), \
   (HANDLE)->LDM_Instruction |= LDM_Decoder[(REG)] )
#define DMA2D_CL_LDM_WRITE_REG(HANDLE, REG, VALUE) \
  ((HANDLE)->LDM_Reg_values[(REG)] = (VALUE), \
   (HANDLE)->LDM_Instruction |= LDM_Decoder[(REG)])
#define RBS_TO_RING_BUFFER_SIZE(val)  (1UL << ((val) + 6U))
#endif /* USE_DMA2D_COMMAND_LIST_MODE == 1 */
/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @addtogroup DMA2D_Private_Functions DMA2D Private Functions
  * @{
  */
#if (USE_DMA2D_COMMAND_LIST_MODE == 1)
static void DMA2D_CL_SetConfig(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t pdata, uint32_t DstAddress, uint32_t Width,
                               uint32_t Height);
#endif /* USE_DMA2D_COMMAND_LIST_MODE == 1 */
#if (USE_DMA2D_COMMAND_LIST_MODE == 0)
static void DMA2D_SetConfig(DMA2D_HandleTypeDef *hdma2d, uint32_t pdata, uint32_t DstAddress, uint32_t Width,
                            uint32_t Height);
#endif /* USE_DMA2D_COMMAND_LIST_MODE == 0 */
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup DMA2D_Exported_Functions DMA2D Exported Functions
  * @{
  */

/** @defgroup DMA2D_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief   Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
                ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize and configure the DMA2D
      (+) De-initialize the DMA2D

@endverbatim
  * @{
  */
#if (USE_DMA2D_COMMAND_LIST_MODE == 0)
/**
  * @brief  Initialize the DMA2D according to the specified
  *         parameters in the DMA2D_InitTypeDef and create the associated handle.
  * @param  hdma2d pointer to a DMA2D_HandleTypeDef structure that contains
  *                 the configuration information for the DMA2D.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_Init(DMA2D_HandleTypeDef *hdma2d)
{
  /* Check the DMA2D peripheral state */
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_DMA2D_ALL_INSTANCE(hdma2d->Instance));
  assert_param(IS_DMA2D_MODE(hdma2d->Init.Mode));
  assert_param(IS_DMA2D_CMODE(hdma2d->Init.ColorMode));
  assert_param(IS_DMA2D_OFFSET(hdma2d->Init.OutputOffset));
  assert_param(IS_DMA2D_ALPHA_INVERTED(hdma2d->Init.AlphaInverted));
  assert_param(IS_DMA2D_RB_SWAP(hdma2d->Init.RedBlueSwap));
  assert_param(IS_DMA2D_LOM_MODE(hdma2d->Init.LineOffsetMode));
  assert_param(IS_DMA2D_BYTES_SWAP(hdma2d->Init.BytesSwap));
  assert_param(IS_DMA2D_ALPHA_POSITION(hdma2d->Init.AlphaPosition));

