zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
  /* Process unlocked */
  __HAL_UNLOCK(hdma2d);

  return HAL_OK;
}


/**
  * @brief  Configure the DMA2D rotation/mirroring for the selected source Foreground, Background or Blender output
  * @param  hdma2d    Pointer to a DMA2D_HandleTypeDef structure that contains
  *                   the configuration information for the DMA2D peripheral.
  * @param  Source  Specifies the source of the tile buffer.
  *                        This parameter can be a value from @ref DMA2D_SOURCE
  * @param  Mirroring_Type   Specifies the mirroring and rotation operation.
  *                          This parameter can be a value from @ref DMA2D_MirroringRotation
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_ConfigRotation(DMA2D_HandleTypeDef *hdma2d, uint32_t Source, uint32_t Mirroring_Type)
{
  /* Check parameters */
  assert_param(IS_DMA2D_ROT_SRC(Source));
  assert_param(IS_DMA2D_ROT_TYPE(Mirroring_Type));


  /* Set tile buffer control register */
  WRITE_REG(hdma2d->Instance->TBCR, Source | (Mirroring_Type << DMA2D_TBCR_XMEN_Pos));

  return HAL_OK;
}

/**
  * @brief  Configures the DMA2D Downscaling for the selected source Foreground, Background or Blender output
  * @param  hdma2d           Pointer to DMA2D handle structure.
  * @param  Source           Specifies the source of the tile buffer.
  *                          This parameter can be a value from @ref DMA2D_SOURCE
  * @param  pDownscalingCfg  Pointer to DMA2D_DownscalingCfgTypeDef that contains
  *                          the configuration information for downscaling.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_ConfigDownscaling(DMA2D_HandleTypeDef *hdma2d, uint32_t Source,
                                              DMA2D_DownscalingCfgTypeDef *pDownscalingCfg)
{
  uint32_t hstep;
  uint32_t vstep;
  uint32_t hq12;
  uint32_t vq12;

  /* Check parameters */
  if ((hdma2d == NULL) || (pDownscalingCfg == NULL))
  {
    return HAL_ERROR;
  }

  assert_param(IS_DMA2D_ALL_INSTANCE(hdma2d->Instance));
  assert_param(IS_DMA2D_SCALE_SRC(Source));
  assert_param(IS_DMA2D_SCALE_PIXEL_PER_LINE(pDownscalingCfg->PixelPerLines));
  assert_param(IS_DMA2D_SCALE_NUMBER_OF_LINES(pDownscalingCfg->NumberOfLines));
  assert_param(IS_DMA2D_SCALE_HPHASE(pDownscalingCfg->HPhase));
  assert_param(IS_DMA2D_SCALE_VPHASE(pDownscalingCfg->VPhase));

  if ((pDownscalingCfg->HRatioDiv == 0U) || (pDownscalingCfg->VRatioDiv == 0U))
  {
    return HAL_ERROR;
  }

  hq12 = (((uint32_t)pDownscalingCfg->HRatio * 4096U) / (uint32_t)pDownscalingCfg->HRatioDiv);
  vq12 = (((uint32_t)pDownscalingCfg->VRatio * 4096U) / (uint32_t)pDownscalingCfg->VRatioDiv);

  hstep = hq12 - 1U;
  vstep = vq12 - 1U;

  assert_param(IS_DMA2D_SCALE_HSTEP(hstep));
  assert_param(IS_DMA2D_SCALE_VSTEP(vstep));

  /* Config scaling source */
  MODIFY_REG(hdma2d->Instance->SCR, DMA2D_SCR_SRC, Source);

  /* Config scaling height and width */
  MODIFY_REG(hdma2d->Instance->SNLR,
             (DMA2D_SNLR_NL | DMA2D_SNLR_PL),
             (pDownscalingCfg->NumberOfLines |
              (pDownscalingCfg->PixelPerLines << DMA2D_SNLR_PL_Pos)));

  /* Config scaling HSTEP and VSTEP */
  WRITE_REG(hdma2d->Instance->SSR, (hstep | (vstep << DMA2D_SSR_VSTEP_Pos)));

  /* Config scaling HPHASE and VPHASE */
  MODIFY_REG(hdma2d->Instance->SPR,
             (DMA2D_SPR_HPHASE | DMA2D_SPR_VPHASE),
             (pDownscalingCfg->HPhase |
              ((uint32_t)pDownscalingCfg->VPhase << DMA2D_SPR_VPHASE_Pos)));

  return HAL_OK;
}

/**
  * @brief  Configure the DMA2D stencil buffer for the selected source Foreground, Background or Blender output.
  * @param  hdma2d      Pointer to DMA2D handle structure.
  * @param  Source      Stencil source selection.
  *                     This parameter can be a value from @ref DMA2D_SOURCE
  * @param  pStencilCfg pointer to DMA2D_StencilCfgTypeDef that contains Stencil buffer configuration.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_ConfigStencil(DMA2D_HandleTypeDef *hdma2d, uint32_t Source,
                                          DMA2D_StencilCfgTypeDef *pStencilCfg)
{

  /* Check parameters */
  assert_param(IS_DMA2D_STENCIL_SRC(Source));
  assert_param(IS_DMA2D_STENCIL_MODE(pStencilCfg->Mode));
  assert_param(IS_DMA2D_STENCIL_LO(pStencilCfg->LineOffset));
  assert_param(IS_DMA2D_STENCIL_HPRE(pStencilCfg->HPre));
  assert_param(IS_DMA2D_STENCIL_HTRAIL(pStencilCfg->HTrail));
  assert_param(IS_DMA2D_STENCIL_ALPHA_INVERTED(pStencilCfg->AlphaInverted));

  /* Configure SBCR: source and mode and Alpha Invert: SRC MODE AI */
  MODIFY_REG(hdma2d->Instance->SBCR, DMA2D_SBCR_SRC | DMA2D_SBCR_MODE | DMA2D_SBCR_AI,
             Source | (pStencilCfg->Mode << DMA2D_SBCR_MODE_Pos) | (pStencilCfg->AlphaInverted << DMA2D_SBCR_AI_Pos));

  /* Set stencil buffer address */
  WRITE_REG(hdma2d->Instance->SBMAR, pStencilCfg->Address);

  /* Set stencil buffer offset */
  MODIFY_REG(hdma2d->Instance->SBOR, DMA2D_SBOR_LO, pStencilCfg->LineOffset);

  /* Set stencil buffer memory skip: Horizontal pre/trail pixels */
  MODIFY_REG(hdma2d->Instance->SBMSR, (DMA2D_SBMSR_HPRE | DMA2D_SBMSR_HTRAIL),
             (pStencilCfg->HPre | (pStencilCfg->HTrail << DMA2D_SBMSR_HTRAIL_Pos)));

  return HAL_OK;
}
/**
  * @brief  Configure the line watermark.
  * @param  hdma2d Pointer to a DMA2D_HandleTypeDef structure that contains
  *                 the configuration information for the DMA2D.
  * @param  Line   Line Watermark configuration (maximum 16-bit long value expected).
  * @note   HAL_DMA2D_ProgramLineEvent() API enables the transfer watermark interrupt.
  * @note   The transfer watermark interrupt is disabled once it has occurred.
  * @retval HAL status
  */

HAL_StatusTypeDef HAL_DMA2D_ProgramLineEvent(DMA2D_HandleTypeDef *hdma2d, uint32_t Line)
{
  /* Check the parameters */
  if (Line > DMA2D_LWR_LW)
  {
    return HAL_ERROR;
  }
  else
  {
    /* Process locked */
    __HAL_LOCK(hdma2d);

    /* Change DMA2D peripheral state */
    hdma2d->State = HAL_DMA2D_STATE_BUSY;

    /* Sets the Line watermark configuration */
    WRITE_REG(hdma2d->Instance->LWR, Line);

    /* Enable the Line interrupt */
    __HAL_DMA2D_ENABLE_IT(hdma2d, DMA2D_IT_TW);

