zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
  if (hdma2d->State == HAL_DMA2D_CL_STATE_RESET)
  {
    /* Reset Callback pointers in HAL_DMA2D_CL_STATE_RESET only */
    hdma2d->LineEventCallback              = HAL_DMA2D_CL_LineEventCallback;
    hdma2d->CLUTLoadingCpltCallback        = HAL_DMA2D_CL_CLUTLoadingCpltCallback;
    hdma2d->RBXferCpltCallback             = HAL_DMA2D_CL_RBXferCpltCallback;
    hdma2d->CL_SuspendCallback             = HAL_DMA2D_CL_SuspendCallback;
    hdma2d->CL_GeneralPurposeEventCallback = HAL_DMA2D_CL_GeneralPuposeEventCallback;
    hdma2d->XferErrorCallback              = HAL_DMA2D_CL_XferErrorCallback;
    hdma2d->XferCpltCallback               = HAL_DMA2D_CL_TransferCpltCallback;
    hdma2d->ErrorCallback                  = HAL_DMA2D_CL_ErrorCallback;
    hdma2d->MspDeInitCallback              = HAL_DMA2D_CL_MspDeInit;
    if (hdma2d->MspInitCallback == NULL)
    {
      hdma2d->MspInitCallback = HAL_DMA2D_CL_MspInit;
    }
    /* Init the low level hardware */
    hdma2d->MspInitCallback(hdma2d);
  }
#else
  if (hdma2d->State == HAL_DMA2D_CL_STATE_RESET)
  {
    /* Init the low level hardware */
    HAL_DMA2D_CL_MspInit(hdma2d);
  }
#endif /* (USE_HAL_DMA2D_REGISTER_CALLBACKS) */
  if (hdma2d->State == HAL_DMA2D_CL_STATE_RESET)
  {
    /* Reset Read and write pointers */
    hdma2d->Instance->RBWPR = 0;
    hdma2d->Instance->RBHPR = 0;
    /* Configure the Ring Buffer Size and Base Address */
    WRITE_REG(hdma2d->Instance->RBBAR, (uint32_t)hdma2d->RingBuffer.Address);
    MODIFY_REG(hdma2d->Instance->CLCR, DMA2D_CLCR_RBS, (hdma2d->RingBuffer.Size << DMA2D_CLCR_RBS_Pos));
    hdma2d->LDM_Instruction = 0;
    uint32_t index;
    for (index = 0 ; index < HAL_DMA2D_CL_LDM_REG_NUM; index++)
    {
      hdma2d->LDM_Reg_values[index] = 0x00000000;
    }
    /* Update error code */
    hdma2d->ErrorCode = HAL_DMA2D_ERROR_NONE;
    /* Initialize the DMA2D state*/
    hdma2d->State  = HAL_DMA2D_CL_STATE_READY;
  }
  /* DMA2D CR register configuration -------------------------------------------*/
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_CR_REG, DMA2D_CR_MODE | DMA2D_CR_LOM,
                          hdma2d->Init.Mode | hdma2d->Init.LineOffsetMode);
  /* DMA2D OPFCCR register configuration ---------------------------------------*/
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_OPFCCR_REG, DMA2D_OPFCCR_CM | DMA2D_OPFCCR_SB,
                          hdma2d->Init.ColorMode | hdma2d->Init.BytesSwap);
  /* DMA2D OOR register configuration ------------------------------------------*/
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_OOR_REG, DMA2D_OOR_LO, hdma2d->Init.OutputOffset);
  /* DMA2D OPFCCR AI AP and RBS fields setting (Output Alpha Inversion)*/
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_OPFCCR_REG, (DMA2D_OPFCCR_AI | DMA2D_OPFCCR_RBS | DMA2D_OPFCCR_APOS),
                          ((hdma2d->Init.AlphaInverted << DMA2D_OPFCCR_AI_Pos) | \
                           (hdma2d->Init.RedBlueSwap << DMA2D_OPFCCR_RBS_Pos) | \
                           (hdma2d->Init.AlphaPosition << DMA2D_OPFCCR_APOS_Pos)));

  return HAL_OK;
}

/**
  * @brief  Deinitializes the DMA2D peripheral registers to their default reset
  *         values.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
HAL_StatusTypeDef HAL_DMA2D_CL_DeInit(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Check the DMA2D peripheral state */
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  /* Abort CMD List */
  hdma2d->Instance->CLCR   = 0x4;

  /* Reset DMA2D control registers */
  hdma2d->Instance->CR       = 0U;
  hdma2d->Instance->IFCR     = 0U;
  hdma2d->Instance->FGOR     = 0U;
  hdma2d->Instance->BGOR     = 0U;
  hdma2d->Instance->FGPFCCR  = 0U;
  hdma2d->Instance->BGPFCCR  = 0U;
  hdma2d->Instance->OPFCCR   = 0U;

  hdma2d->Instance->SBCR  = 0;
  hdma2d->Instance->SBMAR = 0;
  hdma2d->Instance->SBOR  = 0;

  hdma2d->Instance->RBBAR  = 0;
  hdma2d->Instance->RBHPR  = 0;
  hdma2d->Instance->RBWPR  = 0;
  hdma2d->Instance->LBCBAR = 0;
  hdma2d->Instance->LBCSR  = 0;
  hdma2d->Instance->LBCAR  = 0;
  hdma2d->Instance->GPFCR  = 0;

  /* Disable CL and clear LDM , RING BUFFER and cmdlist offset */
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)

  if (hdma2d->MspDeInitCallback == NULL)
  {
    hdma2d->MspDeInitCallback = HAL_DMA2D_CL_MspDeInit;
  }

  /* DeInit the low level hardware */
  hdma2d->MspDeInitCallback(hdma2d);

#else
  /* Carry on with de-initialization of low level hardware */
  HAL_DMA2D_CL_MspDeInit(hdma2d);
#endif /* (USE_HAL_DMA2D_REGISTER_CALLBACKS) */

  /* Update error code */
  hdma2d->ErrorCode = HAL_DMA2D_ERROR_NONE;

  /* Initialize the DMA2D state*/
  hdma2d->State  = HAL_DMA2D_CL_STATE_RESET;

  return HAL_OK;
}
/**
  * @brief  Add Layer Configuration LDM with the specified parameters.
  * @note This function sets up the register values for the layer configuration along with the specific LDM instruction.
  *       These will be saved in the chosen command list via HAL_DMA2D_CL_InsertCommandList().
  *       When the Command List execution begins, the internal registers will be loaded according to the prepared
  *       register values and the corresponding instruction.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  LayerIdx (DMA2D Layer index): it can be one of the following values:
  *                   DMA2D_BACKGROUND_LAYER(0) / DMA2D_FOREGROUND_LAYER(1)
  * @param  pLayerCfg Pointer to a DMA2D_LayerCfgTypeDef structure that contains
  *                   the configuration parameters for the specified layer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_AddConfigLayerCMD(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t LayerIdx,
                                                 DMA2D_LayerCfgTypeDef *pLayerCfg)
{
  uint32_t regMask;
  uint32_t regValue;

  /* Check the parameters */
  assert_param(IS_DMA2D_LAYER(LayerIdx));
  assert_param(IS_DMA2D_OFFSET(pLayerCfg->InputOffset));
  if (hdma2d->Init.Mode != DMA2D_R2M)
  {
    assert_param(IS_DMA2D_INPUT_COLOR_MODE(pLayerCfg->InputColorMode));
    if (hdma2d->Init.Mode != DMA2D_M2M)
    {
      assert_param(IS_DMA2D_ALPHA_MODE(pLayerCfg->AlphaMode));
    }
  }

  assert_param(IS_DMA2D_ALPHA_INVERTED(pLayerCfg->AlphaInverted));
  assert_param(IS_DMA2D_RB_SWAP(pLayerCfg->RedBlueSwap));
  assert_param(IS_DMA2D_ALPHA_POSITION(pLayerCfg->AlphaPosition));
  assert_param(IS_DMA2D_CHROMA_SUB_SAMPLING(pLayerCfg->ChromaSubSampling));

  /* Prepare the value to be written to the BGPFCCR or FGPFCCR register */
  regValue = pLayerCfg->InputColorMode | (pLayerCfg->AlphaMode << DMA2D_BGPFCCR_AM_Pos) | \
             (pLayerCfg->AlphaInverted << DMA2D_BGPFCCR_AI_Pos) | (pLayerCfg->RedBlueSwap << DMA2D_BGPFCCR_RBS_Pos) | \
             (pLayerCfg->AlphaPosition << DMA2D_BGPFCCR_APOS_Pos);
  regMask  = (DMA2D_BGPFCCR_CM | DMA2D_BGPFCCR_AM | DMA2D_BGPFCCR_ALPHA | DMA2D_BGPFCCR_AI | DMA2D_BGPFCCR_RBS | \
              DMA2D_BGPFCCR_APOS);


  if ((pLayerCfg->InputColorMode == DMA2D_INPUT_A8) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A2) || \
      (pLayerCfg->InputColorMode == DMA2D_INPUT_A2) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A1))
  {
    regValue |= (pLayerCfg->InputAlpha & DMA2D_BGPFCCR_ALPHA);
  }
  else
  {
    regValue |= (pLayerCfg->InputAlpha << DMA2D_BGPFCCR_ALPHA_Pos);
  }

  /* Configure the background DMA2D layer */
  if (LayerIdx == DMA2D_BACKGROUND_LAYER)
  {
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_BGPFCCR_REG, regMask, regValue);
    DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_BGOR_REG, pLayerCfg->InputOffset);

    /* DMA2D BGCOLR register configuration -------------------------------------*/
    if ((pLayerCfg->InputColorMode == DMA2D_INPUT_A8) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A2) || \
        (pLayerCfg->InputColorMode == DMA2D_INPUT_A2) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A1))
    {
      DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_BGCOLR_REG, pLayerCfg->InputAlpha & (DMA2D_BGCOLR_BLUE | \
                                                                                   DMA2D_BGCOLR_GREEN | \
                                                                                   DMA2D_BGCOLR_RED));
    }

