zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
  }
  /* Configure the foreground DMA2D layer */
  else
  {
    if (pLayerCfg->InputColorMode == DMA2D_INPUT_YCBCR)
    {
      regValue |= (pLayerCfg->ChromaSubSampling << DMA2D_FGPFCCR_CSS_Pos);
      regMask  |= DMA2D_FGPFCCR_CSS;
    }

    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_FGPFCCR_REG, regMask, regValue);
    DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_FGOR_REG, pLayerCfg->InputOffset);

    /* DMA2D FGCOLR register configuration -------------------------------------*/
    if ((pLayerCfg->InputColorMode == DMA2D_INPUT_A8) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A2) || \
        (pLayerCfg->InputColorMode == DMA2D_INPUT_A2) || (pLayerCfg->InputColorMode == DMA2D_INPUT_A1))
    {
      DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_FGCOLR_REG, pLayerCfg->InputAlpha & (DMA2D_FGCOLR_BLUE | \
                                                                                   DMA2D_FGCOLR_GREEN | \
                                                                                   DMA2D_FGCOLR_RED));
    }
  }

  return HAL_OK;
}

/**
  * @brief  Add Rotation Configuration LDM with the specified parameters.
  * @note This function sets up the register values for the rotation configuration along with
  *       the specific LDM instruction.
  *       These will be saved in the chosen command list via HAL_DMA2D_CL_InsertCommandList().
  *       When the Command List execution begins, the internal registers will be loaded according to the prepared
  *       register values and the corresponding instruction.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  Source      Specifies the source to configure for the rotation.
  *                     This parameter can be one value of @ref DMA2D_SOURCE
  * @param  Mirror_type Specifies the Mirror type to be configured
  *                     This parameter can be one value of @ref DMA2D_MirroringRotation
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_AddConfigRotationCMD(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t Source,
                                                    uint32_t Mirroring_Type)
{
  /* Check the DMA2D channel handle parameter */
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DMA2D_ROT_SRC(Source));
  assert_param(IS_DMA2D_ROT_TYPE(Mirroring_Type));

  /* Set tile buffer control register */
  DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_TBCR_REG, Source | (Mirroring_Type << DMA2D_TBCR_XMEN_Pos));

  return HAL_OK;
}

/**
  * @brief  Add downscaling Configuration LDM for the specified source.
  * @note This function sets up the register values for the layer configuration along with the specific LDM instruction.
  *       These will be saved in the chosen command list via HAL_DMA2D_CL_InsertCommandList().
  *       When the Command List execution begins, the internal registers will be loaded according to the prepared
  *       register values and the corresponding instruction
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  Source      Specifies the source to configure for the downscaling.
  *                     This parameter can be one value of @ref DMA2D_SOURCE
  * @param  pDownscalingCfg Pointer to a DMA2D_DownscalingCfgTypeDef structure that contains
  *                         the downscaling parameters such as pixels per line, number of lines,
  *                         vertical and horizontal step sizes, and phase offsets.
  *  The downscaling configuration is not intended to be updated at runtime.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_AddConfigDownscalingCMD(DMA2D_CL_HandleTypeDef *const hdma2d, uint32_t Source,
                                                       DMA2D_DownscalingCfgTypeDef *pDownscalingCfg)
{
  uint32_t hstep;
  uint32_t vstep;
  uint32_t hq12;
  uint32_t vq12;

  /* Check parameters */
  if ((hdma2d == NULL) || (pDownscalingCfg == NULL))
  {
    return HAL_ERROR;
  }

  assert_param(IS_DMA2D_ALL_INSTANCE(hdma2d->Instance));
  assert_param(IS_DMA2D_SCALE_SRC(Source));
  assert_param(IS_DMA2D_SCALE_PIXEL_PER_LINE(pDownscalingCfg->PixelPerLines));
  assert_param(IS_DMA2D_SCALE_NUMBER_OF_LINES(pDownscalingCfg->NumberOfLines));
  assert_param(IS_DMA2D_SCALE_HPHASE(pDownscalingCfg->HPhase));
  assert_param(IS_DMA2D_SCALE_VPHASE(pDownscalingCfg->VPhase));

  if ((pDownscalingCfg->HRatioDiv == 0U) || (pDownscalingCfg->VRatioDiv == 0U))
  {
    return HAL_ERROR;
  }

  hq12 = (((uint32_t)pDownscalingCfg->HRatio * 4096U) / (uint32_t)pDownscalingCfg->HRatioDiv);
  vq12 = (((uint32_t)pDownscalingCfg->VRatio * 4096U) / (uint32_t)pDownscalingCfg->VRatioDiv);

  hstep = hq12 - 1U;
  vstep = vq12 - 1U;

  assert_param(IS_DMA2D_SCALE_HSTEP(hstep));
  assert_param(IS_DMA2D_SCALE_VSTEP(vstep));

  /* Config scaling source */
  DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_SCR_REG, Source);

  /* Config scaling Height and Width */
  DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_SNLR_REG, (pDownscalingCfg->NumberOfLines |
                                                     (pDownscalingCfg->PixelPerLines << DMA2D_SNLR_PL_Pos)));

  /* Config scaling HSEP and VSTEP */
  DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_SSR_REG, (hstep |(vstep << DMA2D_SSR_VSTEP_Pos)));

  /* Config scaling HPHASE and VPHASE */
  DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_SPR_REG, (pDownscalingCfg->HPhase |
                                                    (pDownscalingCfg->VPhase << DMA2D_SPR_VPHASE_Pos)));

  return HAL_OK;

}
/**
  * @brief  Add Stencil Configuration LDM for the specified source.
  * @note This function sets up the register values for the layer configuration along with the specific LDM instruction.
  *       These will be saved in the chosen command list via HAL_DMA2D_CL_InsertCommandList().
  *       When the Command List execution begins, the internal registers will be loaded according to the prepared
  *       register values and the corresponding instruction
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  Source      Specifies the source to configure for the stenciling.
  *                     This parameter can be one value of @ref DMA2D_SOURCE
  * @param  pStencilCfg Pointer to a DMA2D_StencilCfgTypeDef structure that contains
  *                     the stencil configuration parameters such as vertical and horizontal trail and pre values.
  *  The Stencil configuration is not intended to be updated at runtime.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_AddConfigStencilCMD(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t Source,
                                                   DMA2D_StencilCfgTypeDef *pStencilCfg)
{
  /* Check the DMA2D channel handle parameter */
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DMA2D_STENCIL_SRC(Source));
  assert_param(IS_DMA2D_STENCIL_MODE(pStencilCfg->Mode));
  assert_param(IS_DMA2D_STENCIL_LO(pStencilCfg->LineOffset));
  assert_param(IS_DMA2D_STENCIL_HPRE(pStencilCfg->HPre));
  assert_param(IS_DMA2D_STENCIL_HTRAIL(pStencilCfg->HTrail));
  assert_param(IS_DMA2D_STENCIL_ALPHA_INVERTED(pStencilCfg->AlphaInverted));

  /* Configure SBCR: source and mode and Alpha Invert: SRC MODE AI */
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_SBCR_REG, DMA2D_SBCR_SRC | DMA2D_SBCR_MODE | DMA2D_SBCR_AI,
                          (Source | (pStencilCfg->Mode << DMA2D_SBCR_MODE_Pos) | \
                           (pStencilCfg->AlphaInverted << DMA2D_SBCR_AI_Pos)));

  /* Set stencil buffer address */
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_SBMAR_REG, DMA2D_SBMAR_MA, pStencilCfg->Address);

  /* Set stencil buffer offset */
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_SBOR_REG, DMA2D_SBOR_LO, pStencilCfg->LineOffset);

  /* Set stencil buffer memory skip: Horizontal pre/trail pixels */
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_SBMSR_REG, (DMA2D_SBMSR_HPRE | DMA2D_SBMSR_HTRAIL),
                          (pStencilCfg->HPre | (pStencilCfg->HTrail << DMA2D_SBMSR_HTRAIL_Pos)));

  return HAL_OK;
}

/**
  * @brief  Configure the line watermark in Command List (CL) mode.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  Line   Line Watermark configuration (maximum 16-bit long value expected).
  * @note   This API programs the line watermark register and enables the transfer watermark interrupt.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_AddProgramLineEventCMD(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t Line)
{
  /* Check the DMA2D channel handle parameter */
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  if (Line > DMA2D_LWR_LW)
  {
    return HAL_ERROR;
  }

  /* Sets the Line watermark configuration */
  WRITE_REG(hdma2d->Instance->LWR, Line);

  /* Enable the Line interrupt (transfer watermark) */
  __HAL_DMA2D_ENABLE_IT(hdma2d, DMA2D_IT_TW);

  return HAL_OK;
}

/**
  * @brief  Add a CLUT Loading operation LDM with the specified parameters in DMA2D_CLUTCfgTypeDef
  *         and copy the prepared LDM instructions and register values. to the chosen Command List address.
  * @note This function sets up the register values for this configuration along with the specific LDM instruction.
  *       These will be saved in the chosen command list via HAL_DMA2D_CL_InsertCommandList().
  *       When the Command List execution begins, the internal registers will be loaded according to the prepared
  *       register values and the corresponding instruction
  * @param  hdma2d   Pointer to a DMA2D_HandleTypeDef structure that contains
  *                   the configuration information for the DMA2D.
  * @param  CLUTCfg  Pointer to a DMA2D_CLUTCfgTypeDef structure that contains
  *                   the configuration information for the color look up table.
  * @param  LayerIdx DMA2D Layer index.
  *                   This parameter can be one of the following values:
  *                   DMA2D_BACKGROUND_LAYER(0) / DMA2D_FOREGROUND_LAYER(1)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_AddCLUTStartLoadCMD(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t LayerIdx,
                                                   const DMA2D_CLUTCfgTypeDef *CLUTCfg,
                                                   DMA2D_CL_CommandListTypeDef *pCommandList)
{
  uint8_t reg_index;

  /* Check the parameters */
  assert_param(IS_DMA2D_LAYER(LayerIdx));
  assert_param(IS_DMA2D_CLUT_CM(CLUTCfg->CLUTColorMode));
  assert_param(IS_DMA2D_CLUT_SIZE(CLUTCfg->Size));

  /* Change DMA2D peripheral state */
  hdma2d->State = HAL_DMA2D_CL_STATE_BUSY;

  /* Configure the CLUT of the background DMA2D layer */
  if (LayerIdx == DMA2D_BACKGROUND_LAYER)
  {
    /* Write background CLUT memory address */
    DMA2D_CL_LDM_WRITE_REG(hdma2d, hdma2d->Instance->BGCMAR, (uint32_t)CLUTCfg->pCLUT);

    /* Write background CLUT size and CLUT color mode */
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_BGPFCCR_REG, (DMA2D_BGPFCCR_CS | DMA2D_BGPFCCR_CM),
                            ((CLUTCfg->Size << DMA2D_BGPFCCR_CS_Pos) |
                             (CLUTCfg->CLUTColorMode << DMA2D_BGPFCCR_CM_Pos)));

