zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
    /* Enable the CLUT Transfer Complete, transfer Error, configuration Error and CLUT Access Error interrupts */
    __HAL_DMA2D_ENABLE_IT(hdma2d, DMA2D_IT_CTC | DMA2D_IT_TE | DMA2D_IT_CE | DMA2D_IT_CAE);

    /* Enable the CLUT loading for the background */
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_BGPFCCR_REG, DMA2D_BGPFCCR_START,  DMA2D_BGPFCCR_START);
  }
  /* Configure the CLUT of the foreground DMA2D layer */
  else
  {
    /* Write foreground CLUT memory address */
    DMA2D_CL_LDM_WRITE_REG(hdma2d, hdma2d->Instance->FGCMAR, (uint32_t)CLUTCfg->pCLUT);

    /* Write foreground CLUT size and CLUT color mode */
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_FGPFCCR_REG, (DMA2D_FGPFCCR_CS | DMA2D_FGPFCCR_CM),
                            ((CLUTCfg->Size << DMA2D_FGPFCCR_CS_Pos) |
                             (CLUTCfg->CLUTColorMode << DMA2D_FGPFCCR_CM_Pos)));

    /* Enable the CLUT Transfer Complete, transfer Error, configuration Error and CLUT Access Error interrupts */
    __HAL_DMA2D_ENABLE_IT(hdma2d, DMA2D_IT_CTC | DMA2D_IT_TE | DMA2D_IT_CE | DMA2D_IT_CAE);

    /* Enable the CLUT loading for the foreground */
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_FGPFCCR_REG, DMA2D_FGPFCCR_START, DMA2D_FGPFCCR_START);
  }

  if (pCommandList->Index != pCommandList->Size)
  {
    pCommandList->Address[pCommandList->Index++] = hdma2d->LDM_Instruction;
  }
  else
  {
    return HAL_ERROR;
  }

  for (reg_index = 0; reg_index < HAL_DMA2D_CL_LDM_REG_NUM; reg_index++)
  {
    if (hdma2d->LDM_Instruction & LDM_Decoder[reg_index])
    {
      if (pCommandList->Index != pCommandList->Size)
      {
        pCommandList->Address[pCommandList->Index++] = hdma2d->LDM_Reg_values[reg_index];
      }
      else
      {
        return HAL_ERROR;
      }
    }
  }

  hdma2d->LDM_Instruction = 0;

  return HAL_OK;
}

/**
  * @brief  Add a copy operation LDM from a source buffer to a destination address with the specified width and height
  *         and copy the prepared LDM instructions and register values. to the chosen Command List address.
  * @note This function sets up the register values for the layer configuration along with the specific LDM instruction.
  *       These will be saved in the chosen command list via HAL_DMA2D_CL_InsertCommandList().
  *       When the Command List execution begins, the internal registers will be loaded according to the prepared
  *       register values and the corresponding instruction
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  pdata        Source buffer address from which data will be copied.
  * @param  DstAddress   Destination address where data will be copied.
  * @param  Width        Width of the data area to copy, in pixels.
  * @param  Height       Height of the data area to copy, in lines.
  * @param  pCommandList Pointer to a DMA2D_CL_CommandListTypeDef structure that holds
  *                      the command list where the copy command will be appended.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_AddCopyCMD(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t pdata, uint32_t DstAddress,
                                          uint32_t Width, uint32_t Height, DMA2D_CL_CommandListTypeDef *pCommandList)
{
  uint8_t reg_index;
  uint32_t rb_size;

  /* Check the DMA2D channel handle parameter */
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_DMA2D_LINE(Height));
  assert_param(IS_DMA2D_PIXEL(Width));

  rb_size = ((hdma2d->Instance->CLCR & DMA2D_CLCR_RBS) >> DMA2D_CLCR_RBS_Pos);

  if (rb_size > hdma2d->RingBuffer.Size)
  {
    return HAL_ERROR;
  }

  /* Configure the source, destination address and the data size */
  DMA2D_CL_SetConfig(hdma2d, pdata, DstAddress, Width, Height);

  /* Enable the Peripheral */
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_CR_REG, DMA2D_CR_START, DMA2D_CR_START);

  if (pCommandList->Index != pCommandList->Size)
  {
    pCommandList->Address[pCommandList->Index++] = hdma2d->LDM_Instruction;
  }
  else
  {
    return HAL_ERROR;
  }

  for (reg_index = 0; reg_index < HAL_DMA2D_CL_LDM_REG_NUM; reg_index++)
  {
    if (hdma2d->LDM_Instruction & LDM_Decoder[reg_index])
    {
      if (pCommandList->Index != pCommandList->Size)
      {
        pCommandList->Address[pCommandList->Index++] = hdma2d->LDM_Reg_values[reg_index];
      }
      else
      {
        return HAL_ERROR;
      }
    }
  }

  hdma2d->LDM_Instruction = 0;

  return HAL_OK;
}

/**
  * @brief  Add a blending operation LDM between two source buffers to a destination address with specified width
  *         and height.
  * @note This function sets up the register values for the layer configuration along with the specific LDM instruction.
  *       These will be saved in the chosen command list via HAL_DMA2D_CL_InsertCommandList().
  *       When the Command List execution begins, the internal registers will be loaded according to the prepared
  *       register values and the corresponding instruction
  *       Copy the prepared LDM instructions and register values to the chosen Command List address.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  SrcAddress1  Source address of the first input buffer for blending.
  * @param  SrcAddress2  Source address of the second input buffer for blending.
  * @param  DstAddress   Destination address where the blended result will be stored.
  * @param  Width        Width of the data area to blend, in pixels.
  * @param  Height       Height of the data area to blend, in lines.
  * @param  pCommandList Pointer to a DMA2D_CL_CommandListTypeDef structure that holds
  *                      the command list where the blending command will be appended.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_AddBlendingCMD(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t SrcAddress1,
                                              uint32_t SrcAddress2, uint32_t DstAddress, uint32_t Width,
                                              uint32_t Height, DMA2D_CL_CommandListTypeDef *pCommandList)
{
  uint8_t reg_index;

  /* Check the DMA2D channel handle parameter */
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_DMA2D_LINE(Height));
  assert_param(IS_DMA2D_PIXEL(Width));


  if (hdma2d->Init.Mode == DMA2D_M2M_BLEND_FG)
  {
    /*blending & fixed FG*/
    DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_FGCOLR_REG, SrcAddress1);
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_FGPFCCR_REG, (DMA2D_FGPFCCR_ALPHA), (SrcAddress1 & 0xFF000000));

    /* Configure the source, destination address and the data size */
    DMA2D_CL_SetConfig(hdma2d, SrcAddress2, DstAddress, Width, Height);
  }
  else if (hdma2d->Init.Mode == DMA2D_M2M_BLEND_BG)
  {
    /*blending & fixed BG*/
    DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_BGCOLR_REG, SrcAddress2);
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_BGPFCCR_REG, (DMA2D_BGPFCCR_ALPHA), (SrcAddress2 & 0xFF000000));

    /* Configure the source, destination address and the data size */
    DMA2D_CL_SetConfig(hdma2d, SrcAddress1, DstAddress, Width, Height);
  }
  else
  {
    /* Configure DMA2D Stream source2 address */
    DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_BGMAR_REG, SrcAddress2);

    /* Configure the source, destination address and the data size */
    DMA2D_CL_SetConfig(hdma2d, SrcAddress1, DstAddress, Width, Height);
  }

  /* Enable the Start Transfer Bit */
  DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_CR_REG, (DMA2D_CR_START), DMA2D_CR_START);

  if (pCommandList->Index != pCommandList->Size)
  {
    pCommandList->Address[pCommandList->Index++] = hdma2d->LDM_Instruction;
  }
  else
  {
    return HAL_ERROR;
  }

  for (reg_index = 0; reg_index < HAL_DMA2D_CL_LDM_REG_NUM; reg_index++)
  {
    if (hdma2d->LDM_Instruction & LDM_Decoder[reg_index])
    {
      if (pCommandList->Index != pCommandList->Size)
      {
        pCommandList->Address[pCommandList->Index++] = hdma2d->LDM_Reg_values[reg_index];
      }
      else
      {
        return HAL_ERROR;
      }
    }
  }

  /* Invalidate and reset the LDM handle */
  hdma2d->LDM_Instruction = 0;

  return HAL_OK;
}
/**
  * @brief  Sets up the DMA2D Command List structure by specifying its buffer address and size.
  * @param  Address      Pointer to the memory region allocated for the command list.
  * @param  Size         The command List Size.
  * @param  pCommandList Pointer to the DMA2D_CL_CommandListTypeDef structure to be initialized.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_Init_CommandList(uint32_t *Address, uint32_t Size,
                                                DMA2D_CL_CommandListTypeDef *pCommandList)
{
  pCommandList->Address = Address;
  pCommandList->Size    = Size;
  pCommandList->Index   = 0;

  return HAL_OK;
}

/**
  * @brief  Insert a prepared Command List into the DMA2D ring buffer for execution.
  *         This function writes the command list descriptor into the ring buffer
  *         and configures pre/post-flag operations.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  pCommandList    Pointer to a DMA2D_CL_CommandListTypeDef structure containing
  *                         the command list to be inserted.
  * @param  gpflag          General purpose flag controlling command list behavior.
  * @param  post_flag_config Configuration flags to be applied after command list execution.
  *                          Must be a valid pre/post flag operation.
  * @param  pre_flag_config Configuration flags to be applied before command list execution.
  *                         Must be a valid pre/post flag operation.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_InsertCommandList(DMA2D_CL_HandleTypeDef *hdma2d,
                                                 DMA2D_CL_CommandListTypeDef *pCommandList,
                                                 uint32_t gpflag, uint32_t post_flag_config, uint32_t pre_flag_config)
{
  uint32_t write_ptr;
  uint64_t *descriptor;

  if ((hdma2d == NULL) || (pCommandList == NULL))
  {
    return HAL_ERROR;
  }

  uint32_t *CLaddress = (uint32_t *)pCommandList->Address;

  uint32_t ring_buffer_size = RBS_TO_RING_BUFFER_SIZE(((hdma2d->Instance->CLCR & DMA2D_CLCR_RBS_Msk) >>
                                                       DMA2D_CLCR_RBS_Pos));


