zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
  assert_param(IS_DMA2D_CL_GPFLAG(gpflag));
  assert_param(IS_DMA2D_CL_PRE_POST_FLAG_OPERATION(post_flag_config));
  assert_param(IS_DMA2D_CL_PRE_POST_FLAG_OPERATION(pre_flag_config));
  assert_param(IS_DMA2D_CL_ADDRESS_VALID((uint32_t)pCommandList->Address));
  assert_param(IS_DMA2D_CL_SIZE(pCommandList->Size));


  if (pCommandList->Address[pCommandList->Index] != 0xFFFFFFFF)
  {
    if (pCommandList->Address[pCommandList->Index] != pCommandList->Size)
    {
      pCommandList->Address[pCommandList->Index] = 0xFFFFFFFF;
      pCommandList->Index++;
    }

    else
    {
      return HAL_ERROR;
    }
  }

  write_ptr = hdma2d->Instance->RBWPR;

  uint32_t next_write_ptr = write_ptr + 8;
  if (next_write_ptr >= ring_buffer_size)
  {
    return HAL_ERROR;
  }

  /* descriptor in the first free slot */
  descriptor = (uint64_t *)(hdma2d->Instance->RBBAR + write_ptr);

  /* fill the descriptor */
  *descriptor = ((pCommandList->Index - 1) |
                 (post_flag_config << (24 + 2 * gpflag)) |
                 (pre_flag_config  << (16 + 2 * gpflag)));
  *descriptor <<= 32;
  *descriptor &= 0x00000FFF00000000;

  /* Store last index values to be used for next descriptor after writing @to ring buffer */
  *descriptor += (uint64_t)((uint32_t)CLaddress); /* the selected address passed as cmdlist */


  /* Increment the write pointer */
  hdma2d->Instance->RBWPR = next_write_ptr;

  return HAL_OK;
}
/**
  * @brief  Start the DMA2D Command List execution.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval HAL status
  * @note   The function starts CL execution with all relevant DMA2D interrupts.
  */
HAL_StatusTypeDef HAL_DMA2D_CL_Start(DMA2D_CL_HandleTypeDef *hdma2d)
{
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  if (hdma2d->State != HAL_DMA2D_CL_STATE_BUSY)
  {
    /* Change DMA2D peripheral Cl state */
    hdma2d->State = HAL_DMA2D_CL_STATE_BUSY;

    SET_BIT(hdma2d->Instance->CLCR, DMA2D_CLCR_START);
  }

  __HAL_DMA2D_ENABLE_IT(hdma2d, DMA2D_IT_CE | DMA2D_IT_TW | DMA2D_IT_TC | DMA2D_IT_TE | \
                        DMA2D_IT_CLE | DMA2D_IT_CLS | DMA2D_IT_RBE | DMA2D_IT_RBC);

  return HAL_OK;

}

/**
  * @brief  Start the DMA2D Command List execution with optional interrupt configuration.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  Interrupts Specifies the DMA2D interrupts to enable during command list execution.
  *                   This parameter can be a value or a combination of
  * @retval HAL status
  * @note   The function starts CL execution with the specified DMA2D interrupts.
  */
HAL_StatusTypeDef HAL_DMA2D_CL_StartOpt(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t Interrupts)
{
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  if (hdma2d->State != HAL_DMA2D_CL_STATE_BUSY)
  {
    /* Change DMA2D peripheral Cl state */
    hdma2d->State = HAL_DMA2D_CL_STATE_BUSY;

    SET_BIT(hdma2d->Instance->CLCR, DMA2D_CLCR_START);
  }

  __HAL_DMA2D_ENABLE_IT(hdma2d, Interrupts);

  return HAL_OK;
}

/**
  * @brief  Suspend the DMA2D Command List execution.
  *          The CL suspend operation is effective only after the current command finishes execution.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_Suspend(DMA2D_CL_HandleTypeDef *hdma2d)
{
  uint32_t tickstart;
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  SET_BIT(hdma2d->Instance->CLCR, DMA2D_CLCR_SUSP);

  /* Should wait until the suspend is effective ,
     the DMA2D continue executing the current linear Command List */
  /* The suspend is effective after the completion of the current command being executed */
  tickstart = HAL_GetTick();
  while ((hdma2d->Instance->CLSR & DMA2D_CLSR_SUSPS) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > DMA2D_TIMEOUT_SUSPEND)
    {
      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_TIMEOUT;

      /* Change the DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_TIMEOUT;

      return HAL_TIMEOUT;
    }
  }

  hdma2d->State = HAL_DMA2D_CL_STATE_SUSPEND;

  return HAL_OK;
}

/**
  * @brief  Resume the DMA2D Command List execution
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_Resume(DMA2D_CL_HandleTypeDef *hdma2d)
{
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  CLEAR_BIT(hdma2d->Instance->CLCR, DMA2D_CLCR_SUSP);

  hdma2d->State = HAL_DMA2D_CL_STATE_BUSY;

  return HAL_OK;
}
/**
  * @brief  Abort the DMA2D Command List execution immediately.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_Abort(DMA2D_CL_HandleTypeDef *hdma2d)
{
  if (hdma2d == NULL)
  {
    return HAL_ERROR;
  }

  SET_BIT(hdma2d->Instance->CLCR, DMA2D_CLCR_ABORT);

  hdma2d->State = HAL_DMA2D_CL_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Handle DMA2D Command List interrupt request.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
void HAL_DMA2D_CL_IRQHandler(DMA2D_CL_HandleTypeDef *hdma2d)
{
  uint32_t isrflags = READ_REG(hdma2d->Instance->ISR);
  uint32_t ierflags = READ_REG(hdma2d->Instance->IER);
  uint32_t clsrflags = READ_REG(hdma2d->Instance->CLSR);

  /* Transfer Error Interrupt management ***************************************/
  if ((isrflags & DMA2D_FLAG_TE) != 0U)
  {
    if ((ierflags & DMA2D_IT_TE) != 0U)
    {
      /* Disable the transfer Error interrupt */
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_TE);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_TE;

      /* Clear the transfer error flag */
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_TE);

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_ERROR;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->XferErrorCallback(hdma2d);
#else
      HAL_DMA2D_CL_XferErrorCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */
    }
  }
  /* Configuration Error Interrupt management **********************************/
  if ((isrflags & DMA2D_FLAG_CE) != 0U)
  {
    if ((ierflags & DMA2D_IT_CE) != 0U)
    {
      /* Disable the Configuration Error interrupt */
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_CE);

      /* Clear the Configuration error flag */
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_CE);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_CE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_ERROR;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->XferErrorCallback(hdma2d);
#else
      HAL_DMA2D_CL_XferErrorCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */
    }
  }
  /* CLUT access Error Interrupt management ***********************************/
  if ((isrflags & DMA2D_FLAG_CAE) != 0U)
  {
    if ((ierflags & DMA2D_IT_CAE) != 0U)
    {
      /* Disable the CLUT access error interrupt */
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_CAE);

      /* Clear the CLUT access error flag */
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_CAE);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_CAE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_ERROR;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->XferErrorCallback(hdma2d);
#else
      HAL_DMA2D_CL_XferErrorCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */
    }
  }
  /* Transfer watermark Interrupt management **********************************/
  if ((isrflags & DMA2D_FLAG_TW) != 0U)
  {
    if ((ierflags & DMA2D_IT_TW) != 0U)
    {
      /* Disable the transfer watermark interrupt */
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_TW);

      /* Clear the transfer watermark flag */
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_TW);

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->LineEventCallback(hdma2d);
#else
      HAL_DMA2D_CL_LineEventCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

