zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
    }
  }
  /* Transfer Complete Interrupt management ************************************/
  if ((isrflags & DMA2D_FLAG_TC) != 0U)
  {
    if ((ierflags & DMA2D_IT_TC) != 0U)
    {
      /* Disable the transfer complete interrupt */
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_TC);

      /* Clear the transfer complete flag */
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_TC);

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer complete Callback */
      hdma2d->XferCpltCallback(hdma2d);
#else
      HAL_DMA2D_CL_TransferCpltCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

    }
  }

  /* CLUT Transfer Complete Interrupt management ******************************/
  if ((isrflags & DMA2D_FLAG_CTC) != 0U)
  {
    if ((ierflags & DMA2D_IT_CTC) != 0U)
    {
      /* Disable the CLUT transfer complete interrupt */
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_CTC);

      /* Clear the CLUT transfer complete flag */
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_CTC);

      /* CLUT Transfer complete Callback */
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      hdma2d->CLUTLoadingCpltCallback(hdma2d);
#else
      HAL_DMA2D_CL_CLUTLoadingCpltCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */
    }
  }

  /* Command List Error Interrupt management ******************************/
  if ((isrflags & DMA2D_FLAG_CLE) != 0U)
  {
    if ((ierflags & DMA2D_IT_CLE) != 0U)
    {
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_CLE);

      /* Check the error source */
      if ((clsrflags & DMA2D_FLAG_LCLMSE) != 0U)
      {
        hdma2d->ErrorCode |= HAL_DMA2D_ERROR_LCLMSE;
      }
      if ((clsrflags & DMA2D_FLAG_LCLIE) != 0U)
      {
        hdma2d->ErrorCode |= HAL_DMA2D_ERROR_LCLIE ;
      }
      if ((clsrflags & DMA2D_FLAG_LCLRE) != 0U)
      {
        hdma2d->ErrorCode |= HAL_DMA2D_ERROR_LCLRE;
      }

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_CLE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_ERROR;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->ErrorCallback(hdma2d);
#else
      HAL_DMA2D_CL_ErrorCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

    }
  }

  /* Command List Suspend Interrupt management ******************************/
  if ((isrflags & DMA2D_FLAG_CLS) != 0U)
  {
    if ((ierflags & DMA2D_IT_CLS) != 0U)
    {
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_CLS);
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_CLS);

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_SUSPEND;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->CL_SuspendCallback(hdma2d);
#else
      HAL_DMA2D_CL_SuspendCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

    }
  }

  /* Ring Buffer Error Interrupt management ******************************/
  if ((isrflags & DMA2D_FLAG_RBE) != 0U)
  {
    if ((ierflags & DMA2D_IT_RBE) != 0U)
    {
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_RBE);
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_RBE);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_RBE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_ERROR;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->ErrorCallback(hdma2d);
#else
      HAL_DMA2D_CL_ErrorCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */
    }
  }

  /* Ring Buffer Complete Interrupt management ******************************/
  if ((isrflags & DMA2D_FLAG_RBC) != 0U)
  {
    if ((ierflags & DMA2D_IT_RBC) != 0U)
    {
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_RBC);
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_RBC);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_NONE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_READY;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->RBXferCpltCallback(hdma2d);
#else
      HAL_DMA2D_CL_RBXferCpltCallback(hdma2d);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

    }
  }

  /* General Purpose Flag 0 Interrupt management ********************/
  if ((isrflags & DMA2D_FLAG_GPF0I) != 0U)
  {
    if ((ierflags & DMA2D_IT_GPF0) != 0U)
    {
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_GPF0);
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_GPF0I);
      __HAL_DMA2D_CL_CLEAR_GPFLAG(hdma2d, DMA2D_FLAG_GPF0);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_NONE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_READY;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->CL_GeneralPurposeEventCallback(hdma2d, DMA2D_GPFLAG0);
#else
      HAL_DMA2D_CL_GeneralPuposeEventCallback(hdma2d, DMA2D_GPFLAG0);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

    }
  }

  /* General Purpose Flag 1 Interrupt management ********************/
  if ((isrflags & DMA2D_FLAG_GPF1I) != 0U)
  {
    if ((ierflags & DMA2D_IT_GPF1) != 0U)
    {
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_GPF1);
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_GPF1I);
      __HAL_DMA2D_CL_CLEAR_GPFLAG(hdma2d, DMA2D_FLAG_GPF1);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_NONE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_READY;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->CL_GeneralPurposeEventCallback(hdma2d, DMA2D_GPFLAG1);
#else
      HAL_DMA2D_CL_GeneralPuposeEventCallback(hdma2d, DMA2D_GPFLAG1);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

