zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
    }
  }

  /* General Purpose Flag 2 Interrupt management ********************/
  if ((isrflags & DMA2D_FLAG_GPF2I) != 0U)
  {
    if ((ierflags & DMA2D_IT_GPF2) != 0U)
    {
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_GPF2);
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_GPF2I);
      __HAL_DMA2D_CL_CLEAR_GPFLAG(hdma2d, DMA2D_FLAG_GPF2);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_NONE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_READY;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->CL_GeneralPurposeEventCallback(hdma2d, DMA2D_GPFLAG2);
#else
      HAL_DMA2D_CL_GeneralPuposeEventCallback(hdma2d, DMA2D_GPFLAG2);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

    }
  }

  /* General Purpose Flag 3 Interrupt management ********************/
  if ((isrflags & DMA2D_FLAG_GPF3I) != 0U)
  {
    if ((ierflags & DMA2D_IT_GPF3) != 0U)
    {
      __HAL_DMA2D_DISABLE_IT(hdma2d, DMA2D_IT_GPF3);
      __HAL_DMA2D_CLEAR_FLAG(hdma2d, DMA2D_FLAG_GPF3I);
      __HAL_DMA2D_CL_CLEAR_GPFLAG(hdma2d, DMA2D_FLAG_GPF3);

      /* Update error code */
      hdma2d->ErrorCode |= HAL_DMA2D_ERROR_NONE;

      /* Change DMA2D state */
      hdma2d->State = HAL_DMA2D_CL_STATE_READY;

#if defined (USE_HAL_DMA2D_REGISTER_CALLBACKS) && (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
      /* Transfer error Callback */
      hdma2d->CL_GeneralPurposeEventCallback(hdma2d, DMA2D_GPFLAG3);
#else
      HAL_DMA2D_CL_GeneralPuposeEventCallback(hdma2d, DMA2D_GPFLAG3);
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */
    }
  }

}

/**
  * @brief Reset the Command List Index
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_ResetIndex(DMA2D_CL_CommandListTypeDef *pCommandList)
{
  pCommandList->Index = 0 ;

  return HAL_OK;
}

/**
  * @brief  Initializes the DMA2D MSP.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains
  *                 the configuration information for the DMA2D.
  * @retval None
  */
__weak void HAL_DMA2D_CL_MspInit(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);

  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_MspInit can be implemented in the user file.
   */
}

/**
  * @brief  DeInitializes the DMA2D MSP.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains
  *                 the configuration information for the DMA2D.
  * @retval None
  */
__weak void HAL_DMA2D_CL_MspDeInit(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);

  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_MspDeInit can be implemented in the user file.
   */
}

/**
  * @brief  Ring Buffer Transfer callback.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
__weak void HAL_DMA2D_CL_RBXferCpltCallback(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_RBXferCpltCallback can be implemented in the user file.
   */
}
/**
  * @brief  Line Event callback.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
__weak void HAL_DMA2D_CL_LineEventCallback(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_LineEventCallback can be implemented in the user file.
   */
}

/**
  * @brief  CLUT Transfer Complete callback.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
__weak void HAL_DMA2D_CL_CLUTLoadingCpltCallback(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_CLUTLoadingCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Suspend Event callback.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
__weak void HAL_DMA2D_CL_SuspendCallback(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_SuspendCallback can be implemented in the user file.
   */
}

/**
  * @brief  Transfer Complete callback.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
__weak void HAL_DMA2D_CL_TransferCpltCallback(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_TransferCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Transfer error callback.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
__weak void  HAL_DMA2D_CL_XferErrorCallback(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_XferErrorCallback can be implemented in the user file.
   */
}
/**
  * @brief  Error callback.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
__weak void HAL_DMA2D_CL_ErrorCallback(DMA2D_CL_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_ErrorCallback can be implemented in the user file.
   */
}
/**
  * @brief  General Purpose Flag Event callback.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval None
  */
__weak void HAL_DMA2D_CL_GeneralPuposeEventCallback(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t GeneralPurposeFlag)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);
  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_DMA2D_CL_GeneralPuposeEventCallback can be implemented in the user file.
   */
}

