zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User DMA2D Command List (CL) Callback
  *         To be used instead of the weak (overridden) predefined callback.
  * @param  hdma2d     DMA2D Command List handle.
  * @param  CallbackID ID of the callback to be registered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_DMA2D_CL_RBXFERCPLT_CB_ID         DMA2D Ring Buffer transfer complete Callback ID
  *           @arg @ref HAL_DMA2D_CL_SUSPEND_CB_ID            DMA2D Command List Suspend Callback ID
  *           @arg @ref HAL_DMA2D_CL_XFERERROR_CB_ID          DMA2D Transfer Error Callback ID
  *           @arg @ref HAL_DMA2D_CL_XFERCPLT_CB_ID           DMA2D Transfer Complete Callback ID
  *           @arg @ref HAL_DMA2D_CL_LINEEVENT_CB_ID          DMA2D Line Event Callback ID
  *           @arg @ref HAL_DMA2D_CL_CLUTLOADINGCPLT_CB_ID    DMA2D CLUT Loading Completion Callback ID
  *           @arg @ref HAL_DMA2D_CL_ERROR_CB_ID              DMA2D General Error Callback ID
  *           @arg @ref HAL_DMA2D_CL_MSPINIT_CB_ID            DMA2D MspInit Callback ID
  *           @arg @ref HAL_DMA2D_CL_MSPDEINIT_CB_ID          DMA2D MspDeInit Callback ID
  * @param  pCallback  Pointer to the callback function.
  * @retval status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_RegisterCallback(DMA2D_CL_HandleTypeDef *hdma2d,
                                                HAL_DMA2D_CL_CallbackIDTypeDef CallbackID,
                                                pDMA2D_CL_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }

  if (HAL_DMA2D_CL_STATE_READY == hdma2d->State)
  {
    switch (CallbackID)
    {
      case HAL_DMA2D_CL_RINGBUFFERCOMPLETE_CB_ID:
        hdma2d->RBXferCpltCallback = pCallback;
        break;

      case HAL_DMA2D_CL_SUSPEND_CB_ID:
        hdma2d->CL_SuspendCallback = pCallback;
        break;

      case HAL_DMA2D_CL_TRANSFERERROR_CB_ID:
        hdma2d->XferErrorCallback = pCallback;
        break;

      case HAL_DMA2D_CL_TRANSFERCOMPLETE_CB_ID:
        hdma2d->XferCpltCallback = pCallback;
        break;

      case HAL_DMA2D_CL_LINEEVENT_CB_ID:
        hdma2d->LineEventCallback = pCallback;
        break;

      case HAL_DMA2D_CL_CLUTLOADINGCPLT_CB_ID:
        hdma2d->CLUTLoadingCpltCallback = pCallback;
        break;

      case HAL_DMA2D_CL_ERROR_CB_ID:
        hdma2d->ErrorCallback = pCallback;
        break;

      case HAL_DMA2D_CL_MSPINIT_CB_ID:
        hdma2d->MspInitCallback = pCallback;
        break;

      case HAL_DMA2D_CL_MSPDEINIT_CB_ID:
        hdma2d->MspDeInitCallback = pCallback;
        break;

      default:
        hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else if (HAL_DMA2D_CL_STATE_RESET == hdma2d->State)
  {
    switch (CallbackID)
    {
      case HAL_DMA2D_CL_MSPINIT_CB_ID:
        hdma2d->MspInitCallback = pCallback;
        break;

      case HAL_DMA2D_CL_MSPDEINIT_CB_ID:
        hdma2d->MspDeInitCallback = pCallback;
        break;

      default:
        hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else
  {
    hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

  return status;
}


/**
  * @brief  Unregister a User DMA2D Command List (CL) Callback
  *         Resets the callback pointer to the default weak function.
  * @param  hdma2d     DMA2D Command List handle.
  * @param  CallbackID ID of the callback to be unregistered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_DMA2D_CL_RBXFERCPLT_CB_ID         DMA2D Ring Buffer transfer complete Callback ID
  *           @arg @ref HAL_DMA2D_CL_SUSPEND_CB_ID            DMA2D Command List Suspend Callback ID
  *           @arg @ref HAL_DMA2D_CL_XFERERROR_CB_ID          DMA2D Transfer Error Callback ID
  *           @arg @ref HAL_DMA2D_CL_XFERCPLT_CB_ID           DMA2D Transfer Complete Callback ID
  *           @arg @ref HAL_DMA2D_CL_LINEEVENT_CB_ID          DMA2D Line Event Callback ID
  *           @arg @ref HAL_DMA2D_CL_CLUTLOADINGCPLT_CB_ID    DMA2D CLUT Loading Completion Callback ID
  *           @arg @ref HAL_DMA2D_CL_ERROR_CB_ID              DMA2D General Error Callback ID
  *           @arg @ref HAL_DMA2D_CL_MSPINIT_CB_ID            DMA2D MspInit Callback ID
  *           @arg @ref HAL_DMA2D_CL_MSPDEINIT_CB_ID          DMA2D MspDeInit Callback ID
  * @retval status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_UnRegisterCallback(DMA2D_CL_HandleTypeDef *hdma2d,
                                                  HAL_DMA2D_CL_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (HAL_DMA2D_CL_STATE_READY == hdma2d->State)
  {
    switch (CallbackID)
    {
      case HAL_DMA2D_CL_RINGBUFFERCOMPLETE_CB_ID:
        hdma2d->RBXferCpltCallback = HAL_DMA2D_CL_RBXferCpltCallback;
        break;

      case HAL_DMA2D_CL_SUSPEND_CB_ID:
        hdma2d->CL_SuspendCallback = HAL_DMA2D_CL_SuspendCallback;
        break;

      case HAL_DMA2D_CL_TRANSFERERROR_CB_ID:
        hdma2d->XferErrorCallback = HAL_DMA2D_CL_XferErrorCallback;
        break;

      case HAL_DMA2D_CL_TRANSFERCOMPLETE_CB_ID:
        hdma2d->XferCpltCallback = HAL_DMA2D_CL_TransferCpltCallback;
        break;

      case HAL_DMA2D_CL_LINEEVENT_CB_ID:
        hdma2d->LineEventCallback = HAL_DMA2D_CL_LineEventCallback;
        break;

      case HAL_DMA2D_CL_CLUTLOADINGCPLT_CB_ID:
        hdma2d->CLUTLoadingCpltCallback = HAL_DMA2D_CL_CLUTLoadingCpltCallback;
        break;

      case HAL_DMA2D_CL_ERROR_CB_ID:
        hdma2d->ErrorCallback = HAL_DMA2D_CL_ErrorCallback;
        break;

      case HAL_DMA2D_CL_MSPINIT_CB_ID:
        hdma2d->MspInitCallback = HAL_DMA2D_CL_MspInit;
        break;

      case HAL_DMA2D_CL_MSPDEINIT_CB_ID:
        hdma2d->MspDeInitCallback = HAL_DMA2D_CL_MspDeInit;
        break;

      default:
        hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else if (HAL_DMA2D_CL_STATE_RESET == hdma2d->State)
  {
    switch (CallbackID)
    {
      case HAL_DMA2D_CL_MSPINIT_CB_ID:
        hdma2d->MspInitCallback = HAL_DMA2D_CL_MspInit;
        break;

      case HAL_DMA2D_CL_MSPDEINIT_CB_ID:
        hdma2d->MspDeInitCallback = HAL_DMA2D_CL_MspDeInit;
        break;

      default:
        hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else
  {
    hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

