zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_dma2d.c
  return status;
}


/**
  * @brief  Register a User DMA2D Command List (CL) General Purpose Event Callback
  *         To be used instead of the weak (overridden) predefined callback for general purpose events.
  * @param  hdma2d     DMA2D Command List handle.
  * @param  CallbackID ID of the callback to be registered.
  *         This parameter must be HAL_DMA2D_CL_GP_EVENT_CB_ID.
  * @param  pCallback  Pointer to the general purpose event callback function.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_Register_GeneralPurposeEvent_Callback(DMA2D_CL_HandleTypeDef *hdma2d,
                                                                     HAL_DMA2D_CL_CallbackIDTypeDef CallbackID,
                                                                     pDMA2D_CL_GeneralPurposeEventCallbackTypeDef
                                                                     pCallback)
{

  if (pCallback == NULL)
  {
    hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }

  if (HAL_DMA2D_CL_STATE_READY == hdma2d->State)
  {
    if (CallbackID == HAL_DMA2D_CL_GENERALPURPOSEFLAGEVENT_CB_ID)
    {
      hdma2d->CL_GeneralPurposeEventCallback = pCallback;
    }
  }
  else
  {
    hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Unregister the User DMA2D Command List (CL) General Purpose Event Callback
  *         Resets the callback pointer to the default weak function.
  * @param  hdma2d     DMA2D Command List handle.
  * @param  CallbackID ID of the callback to be unregistered.
  *         This parameter must be HAL_DMA2D_CL_GP_EVENT_CB_ID.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA2D_CL_UnRegister_GeneralPurposeEvent_Callback(DMA2D_CL_HandleTypeDef *hdma2d,
                                                                       HAL_DMA2D_CL_CallbackIDTypeDef CallbackID)
{

  if (HAL_DMA2D_CL_STATE_READY == hdma2d->State)
  {
    if (CallbackID == HAL_DMA2D_CL_GENERALPURPOSEFLAGEVENT_CB_ID)
    {
      hdma2d->CL_GeneralPurposeEventCallback = HAL_DMA2D_CL_GeneralPuposeEventCallback;
    }
  }
  else
  {
    hdma2d->ErrorCode |= HAL_DMA2D_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup DMA2D_Exported_Functions_Group4 Peripheral State and Error functions
  *  @brief    Peripheral State functions
  *
@verbatim
 ===============================================================================
                  ##### Peripheral State and Errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions allowing to:
      (+) Get the DMA2D state
      (+) Get the DMA2D error code

@endverbatim
  * @{
  */
/**
  * @brief  Return the DMA2D state
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval HAL DMA2D state
  */
HAL_DMA2D_CL_StateTypeDef HAL_DMA2D_CL_GetState(const DMA2D_CL_HandleTypeDef *hdma2d)
{
  return hdma2d->State;
}

/**
  * @brief  Return the DMA2D error code
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @retval DMA2D Error Code
  */
uint32_t HAL_DMA2D_CL_GetError(const DMA2D_CL_HandleTypeDef *hdma2d)
{
  return hdma2d->ErrorCode;
}

/** @defgroup DMA2D_Private_Functions DMA2D Private Functions
  * @{
  */
/**
  * @brief  Set the DMA2D transfer parameters.
  * @param  hdma2d pointer to a DMA2D_CL_HandleTypeDef structure that contains the configuration information
  * @param  pdata      The source memory Buffer address
  * @param  DstAddress The destination memory Buffer address
  * @param  Width      The width of data to be transferred from source to destination.
  * @param  Height     The height of data to be transferred from source to destination.
  * @retval None
  */
static void DMA2D_CL_SetConfig(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t pdata, uint32_t DstAddress, uint32_t Width,
                               uint32_t Height)
{
  /* Configure DMA2D data size */
  /* Swap Width and Height when X/Y Swap is enabled */
  if ((hdma2d->Instance->TBCR & DMA2D_TBCR_XYSEN) == DMA2D_TBCR_XYSEN)
  {
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_NLR_REG,
                            (DMA2D_NLR_NL | DMA2D_NLR_PL), (Width | (Height << DMA2D_NLR_PL_Pos)));
  }
  else
  {
    DMA2D_CL_LDM_MODIFY_REG(hdma2d, DMA2D_CL_NLR_REG,
                            (DMA2D_NLR_NL | DMA2D_NLR_PL), (Height | (Width << DMA2D_NLR_PL_Pos)));
  }

  DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_OMAR_REG, DstAddress);
  /* Register to memory DMA2D mode selected */
  if (hdma2d->Init.Mode == DMA2D_R2M)
  {
    /* Write to DMA2D OCOLR register */
    DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_OCOLR_REG, pdata);
  }
  else if (hdma2d->Init.Mode == DMA2D_M2M_BLEND_FG) /*M2M_blending with fixed color FG DMA2D Mode selected*/
  {
    DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_BGMAR_REG, pdata);
  }
  else /* M2M, M2M_PFC,M2M_Blending or M2M_blending with fixed color BG DMA2D Mode */
  {
    DMA2D_CL_LDM_WRITE_REG(hdma2d, DMA2D_CL_FGMAR_REG, pdata);
  }
}
#endif /* USE_DMA2D_COMMAND_LIST_MODE == 1 */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* DMA2D */
#endif /* HAL_DMA2D_MODULE_ENABLED */
